literate/StepwiseMachineTests.org
#+TITLE: Stepwise Interpreter Machine Tests
#+PROPERTY: header-args    :comments both :tangle ../test/StepwiseMachine.test.js

* Preamble

#+begin_src js
import { Machine } from "xstate";
import * as StepwiseMachine from "../src/StepwiseMachine";
import { service as callExecutorService } from "../src/executors/call";
import { service as getExecutorService } from "../src/executors/get";
import { Frame } from "../src/Frame";
import { parseFile } from "concrete-parser";
import { TestInterpreter, toMatchState } from "xstate-jest-tools";
expect.extend({ toMatchState });

const stepwiseMachine =
    Machine(StepwiseMachine.definition)
        .withConfig(StepwiseMachine.config)
        // Supply empty context to avoid warning
        .withContext({});

let interpreter;

beforeEach(() => {
    interpreter = TestInterpreter(stepwiseMachine);
})
#+end_src

* Tests

#+begin_src js
it("Can be instantiated", () => {
    expect(interpreter.S).toMatchState("empty");
})
#+end_src

#+begin_src js
it("Can load a program", async () => {
    const tree = await parseFile("1 2 3");
    interpreter.send({ type: "LOAD_PROGRAM", source: tree });
    expect(interpreter.S).toMatchState("run.read");
    expect(interpreter.C.activeFrame).toEqual(Frame(0, tree.tape));
})
#+end_src

